NgqvngVinh/STM32_LAB_1/ex3+4+5/stm32/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LR1_Pin GPIO_PIN_2
#define LR1_GPIO_Port GPIOA
#define LY1_Pin GPIO_PIN_3
#define LY1_GPIO_Port GPIOA
#define LG1_Pin GPIO_PIN_4
#define LG1_GPIO_Port GPIOA
#define LR2_Pin GPIO_PIN_5
#define LR2_GPIO_Port GPIOA
#define LY2_Pin GPIO_PIN_6
#define LY2_GPIO_Port GPIOA
#define LG2_Pin GPIO_PIN_7
#define LG2_GPIO_Port GPIOA
#define a_Pin GPIO_PIN_0
#define a_GPIO_Port GPIOB
#define b_Pin GPIO_PIN_1
#define b_GPIO_Port GPIOB
#define c_Pin GPIO_PIN_2
#define c_GPIO_Port GPIOB
#define b2_Pin GPIO_PIN_10
#define b2_GPIO_Port GPIOB
#define c2_Pin GPIO_PIN_11
#define c2_GPIO_Port GPIOB
#define d2_Pin GPIO_PIN_12
#define d2_GPIO_Port GPIOB
#define e2_Pin GPIO_PIN_13
#define e2_GPIO_Port GPIOB
#define f2_Pin GPIO_PIN_14
#define f2_GPIO_Port GPIOB
#define g2_Pin GPIO_PIN_15
#define g2_GPIO_Port GPIOB
#define d_Pin GPIO_PIN_3
#define d_GPIO_Port GPIOB
#define e_Pin GPIO_PIN_4
#define e_GPIO_Port GPIOB
#define f_Pin GPIO_PIN_5
#define f_GPIO_Port GPIOB
#define g_Pin GPIO_PIN_6
#define g_GPIO_Port GPIOB
#define a2_Pin GPIO_PIN_9
#define a2_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
